\n - Новая строка
\r - Возврат коретки
\t - Табуляция
_______________________
#include <iostream>
#include <locale.h>

int main()
{
	setlocale(LC_ALL, "Russian");
	...
________________________
#include ..
using namespace std;
________________________
a||b - или
a&&b - и
!a - не a
cout<<x - вывод
cin>>x - ввод
_________________________
sqrt(x) - корень
_________________________
a++ - прибав. на одно значение
a-- - убав. на одно значение
________________________
fact(n) - факториал // 1*2*3*4 = fact(4)
isPrime(n) - число простое, делится только на себя и на 1
________________________
